## 1 - Create a Dataframe from the data and add it to itself

In [17]:
import pandas as pd
import numpy as np

In [18]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [21]:
df_sum = df +df

In [22]:
df_sum

             Name  Age                    City
0      AliceAlice   50        New YorkNew York
1          BobBob   60  Los AngelesLos Angeles
2  CharlieCharlie   70          ChicagoChicago
3      DavidDavid   80          HoustonHouston

## 2 - Create a dataframe from the data and multiply it by two

In [23]:
df_multy = df*2

In [24]:
df_multy

             Name  Age                    City
0      AliceAlice   50        New YorkNew York
1          BobBob   60  Los AngelesLos Angeles
2  CharlieCharlie   70          ChicagoChicago
3      DavidDavid   80          HoustonHouston

## 3 - Are the results from the previous exercises equivalent?

In [ ]:
# Yes they are equivalent, we are just doubling the values in both operation, in the second case its more explicit, the first one can be confusing